app/controllers/customers_controller.rb

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM "customers" WHERE ("customers"."id" = 5)
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO "customers" ("name", "birth", "address", "city", "created_at", "postcode", "updated_at", "document", "mobile", "phone", "email", "state") VALUES('niler', '2008-12-15', '', '', '2008-12-15 23:38:50', '', '2008-12-15 23:38:50', '', '', '', '', '')
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
DELETE FROM "customers" WHERE "id" = 1
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy