app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "created_at", "unit_id", "updated_at", "category_id", "description") VALUES('Tijolo 6 furos', '2008-12-16 00:43:47', 2, '2008-12-16 00:43:47', 1, '')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2008-12-16 00:46:28', "description" = 'teste' WHERE "id" = 1

  def load_units
    @units = Unit.all.map{ |c| [c.abbr, c.id] }
---
SELECT * FROM "units"

  def load_categories
    @categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT * FROM "categories"