app/controllers/units_controller.rb

SELECT * FROM "units" WHERE ("units"."id" = 1)
---
  def show
    @units = Units.find(params[:id])

INSERT INTO "units" ("name", "created_at", "updated_at", "abbr") VALUES('Sacos', '2008-12-16 00:43:21', '2008-12-16 00:43:21', 'sacos')
---
  def create
    @units = Units.new(params[:units])

    respond_to do |format|
      if @units.save